app/views/users/show.html.erb

    <h4 class="your-bookings">Your Bookings</h4>
      <% if @user.host_bookings.blank? %>
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."host_id" = $1  [["host_id", 6]]

            <% flag = false %>
            <%= User.find(booking.guest_id).email %><br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    <h4>Your Trips</h4>
      <% if @user.guest_bookings.blank? %>
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."guest_id" = $1  [["guest_id", 9]]