app/views/home/index.html.erb

SELECT "categories".* FROM "categories"
---
			<!-- 	If we want to search -->
			<%= collection_select(:category, :host_id, Category.all, :title, class: "btn btn-default dropdown-toggle") %>