app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."homebase" = $1  [["homebase", "Austin"]]
SELECT  1 AS one FROM "categories" INNER JOIN "user_categories" ON "categories"."id" = "user_categories"."category_id" WHERE "user_categories"."host_id" = $1 AND "categories"."id" = $2 LIMIT $3  [["host_id", 3], ["id", 2], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" INNER JOIN "user_categories" ON "categories"."id" = "user_categories"."category_id" WHERE "user_categories"."host_id" = $1  [["host_id", 5]]
---
  def show
    @category = Category.find(params[:id])
    hosts_by_location = User.where(homebase: session[:location])
    @filtered_users = []
    hosts_by_location.each do |host|
      if host.categories.include?(@category)