app/controllers/users_controller.rb

UPDATE "users" SET "host" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["host", true], ["updated_at", 2016-11-26 19:48:09 UTC], ["id", 9]]
---
  def become_host
    current_user.host = true
    current_user.save